#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # data.aws_security_group.default will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_group" "default"  {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + tags        = (known after apply)
      + vpc_id      = (known after apply)
    }

  # aws_ec2_transit_gateway_vpc_attachment.tgw_routes will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "tgw_routes" {
      + appliance_mode_support                          = "disable"
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + subnet_ids                                      = (known after apply)
      + tags                                            = {
          + "Name" = "aws001-preprod-teod-eks-tgw"
        }
      + tags_all                                        = {
          + "Name" = "aws001-preprod-teod-eks-tgw"
        }
      + transit_gateway_default_route_table_association = true
      + transit_gateway_default_route_table_propagation = true
      + transit_gateway_id                              = "tgw-08964eff8ffcadaf1"
      + vpc_id                                          = (known after apply)
      + vpc_owner_id                                    = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.data.aws_eks_cluster.cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.data.aws_eks_cluster_auth.cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.aws-eks-accelerator-for-terraform.data.http.eks_cluster_readiness[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "eks_cluster_readiness"  {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-ssp-amazon-eks"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.aws_vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.104.0.0/16",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "aws001-preprod-teod-vpc-endpoint-secgrp"
        }
      + tags_all               = {
          + "Name" = "aws001-preprod-teod-vpc-endpoint-secgrp"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws_vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aws001-preprod-teod-vpc-private-ca-central-1a"
        }
      + tags_all         = {
          + "Name" = "aws001-preprod-teod-vpc-private-ca-central-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aws001-preprod-teod-vpc-private-ca-central-1b"
        }
      + tags_all         = {
          + "Name" = "aws001-preprod-teod-vpc-private-ca-central-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aws001-preprod-teod-vpc-private-ca-central-1d"
        }
      + tags_all         = {
          + "Name" = "aws001-preprod-teod-vpc-private-ca-central-1d"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.104.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                          = "aws001-preprod-teod-vpc-private-ca-central-1a"
          + "kubernetes.io/cluster/aws001-preprod-teod-eks" = "shared"
          + "kubernetes.io/role/internal-elb"               = "1"
        }
      + tags_all                                       = {
          + "Name"                                          = "aws001-preprod-teod-vpc-private-ca-central-1a"
          + "kubernetes.io/cluster/aws001-preprod-teod-eks" = "shared"
          + "kubernetes.io/role/internal-elb"               = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws_vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.104.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                          = "aws001-preprod-teod-vpc-private-ca-central-1b"
          + "kubernetes.io/cluster/aws001-preprod-teod-eks" = "shared"
          + "kubernetes.io/role/internal-elb"               = "1"
        }
      + tags_all                                       = {
          + "Name"                                          = "aws001-preprod-teod-vpc-private-ca-central-1b"
          + "kubernetes.io/cluster/aws001-preprod-teod-eks" = "shared"
          + "kubernetes.io/role/internal-elb"               = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws_vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.104.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                          = "aws001-preprod-teod-vpc-private-ca-central-1d"
          + "kubernetes.io/cluster/aws001-preprod-teod-eks" = "shared"
          + "kubernetes.io/role/internal-elb"               = "1"
        }
      + tags_all                                       = {
          + "Name"                                          = "aws001-preprod-teod-vpc-private-ca-central-1d"
          + "kubernetes.io/cluster/aws001-preprod-teod-eks" = "shared"
          + "kubernetes.io/role/internal-elb"               = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws_vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.104.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "aws001-preprod-teod-vpc"
        }
      + tags_all                             = {
          + "Name" = "aws001-preprod-teod-vpc"
        }
    }

  # module.vpc_endpoint_gateway.aws_vpc_endpoint.this["s3"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "s3-vpc-Gateway"
        }
      + tags_all              = {
          + "Name" = "s3-vpc-Gateway"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["autoscaling"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.autoscaling"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["ec2"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.ec2"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["ec2messages"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.ec2messages"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["ecr_api"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["ecr_dkr"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["elasticloadbalancing"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.elasticloadbalancing"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["kms"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.kms"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["logs"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["ssm"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["sts"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.sts"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + tags_all              = {
          + "Endpoint" = "true"
          + "Project"  = "EKS"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/aws001-preprod-teod-eks/cluster"
      + retention_in_days = 90
      + tags              = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all          = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "aws001-preprod-teod-eks"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all                  = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + version                   = "1.21"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name"        = "aws001-preprod-teod-eks-eks-irsa"
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all        = {
          + "Name"        = "aws001-preprod-teod-eks-eks-irsa"
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "aws001-preprod-teod-eks-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all    = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws001-preprod-teod-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all              = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "aws001-preprod-teod-eks"
      + path                  = "/"
      + tags                  = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all              = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "aws001-preprod-teod-eks-cluster-role"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "aws001-preprod-teod-eks-cluster-role"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "aws001-preprod-teod-eks-cluster-role"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aws001-preprod-teod-eks-cluster-role"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "aws001-preprod-teod-eks"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "aws001-preprod-teod-eks-eks_cluster_sg"
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all               = {
          + "Name"        = "aws001-preprod-teod-eks-eks_cluster_sg"
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "aws001-preprod-teod-eks"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                          = "aws001-preprod-teod-eks-eks_worker_sg"
          + "created-by"                                    = "Terraform v1.0.1"
          + "environment"                                   = "preprod"
          + "kubernetes.io/cluster/aws001-preprod-teod-eks" = "owned"
          + "name"                                          = "aws001-preprod-teod-eks"
          + "resource"                                      = "eks"
          + "tenant"                                        = "aws001"
          + "zone"                                          = "teod"
        }
      + tags_all               = {
          + "Name"                                          = "aws001-preprod-teod-eks-eks_worker_sg"
          + "created-by"                                    = "Terraform v1.0.1"
          + "environment"                                   = "preprod"
          + "kubernetes.io/cluster/aws001-preprod-teod-eks" = "owned"
          + "name"                                          = "aws001-preprod-teod-eks"
          + "resource"                                      = "eks"
          + "tenant"                                        = "aws001"
          + "zone"                                          = "teod"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_aws001-preprod-teod-eks"
      + id                   = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].data.aws_iam_policy_document.managed_ng_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "managed_ng_assume_role_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSWorkerAssumeRole"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Service"
            }
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].aws_eks_node_group.managed_ng will be created
  + resource "aws_eks_node_group" "managed_ng" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = (known after apply)
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "m4.large",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "managed-ondemand"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 10
          + min_size     = 3
        }

      + timeouts {
          + create = "2h"
          + delete = "2h"
          + update = "2h"
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].aws_iam_instance_profile.managed_ng will be created
  + resource "aws_iam_instance_profile" "managed_ng" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all    = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + unique_id   = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].aws_iam_role.managed_ng will be created
  + resource "aws_iam_role" "managed_ng" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all              = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "managed_ng" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "managed_ng" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "managed_ng" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "managed_ng" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_managed_node_groups["mg_4"].aws_launch_template.managed_node_groups will be created
  + resource "aws_launch_template" "managed_node_groups" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Launch Template for EKS Managed Node Groups"
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + tags_all               = (known after apply)
      + update_default_version = true
      + user_data              = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 50
              + volume_type           = "gp2"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.data.aws_eks_cluster.eks_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "eks_cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.data.aws_iam_policy_document.platform_team_eks_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "platform_team_eks_access"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "eks:AccessKubernetesApi",
              + "eks:DescribeCluster",
              + "eks:DescribeNodegroup",
              + "eks:ListClusters",
              + "eks:ListFargateProfiles",
              + "eks:ListNodegroups",
              + "eks:ListUpdates",
              + "ssm:GetParameter",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowPlatformTeamEKSAccess"
        }
      + statement {
          + actions   = [
              + "eks:ListClusters",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowListClusters"
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.aws_iam_policy.platform_team_eks_access will be created
  + resource "aws_iam_policy" "platform_team_eks_access" {
      + arn         = (known after apply)
      + description = "Platform Team EKS Console Access"
      + id          = (known after apply)
      + name        = "aws001-preprod-teod-PlatformTeamEKSAccess"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all    = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.aws_iam_role.platform_team["admin-team-name-example"] will be created
  + resource "aws_iam_role" "platform_team" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::510522433898:role/eks-qa-admin-assume-role",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws001-preprod-teod-admin-team-name-example-Access"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all              = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.aws_iam_role.team_access["bitbuy"] will be created
  + resource "aws_iam_role" "team_access" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::510522433898:role/eks-qa-admin-assume-role",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws001-preprod-teod-bitbuy-Access"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all              = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.aws_iam_role.team_sa_irsa["bitbuy"] will be created
  + resource "aws_iam_role" "team_sa_irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws001-preprod-teod-bitbuy-sa-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all              = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.kubernetes_cluster_role.team["bitbuy"] will be created
  + resource "kubernetes_cluster_role" "team" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "bitbuy-team-cluster-role"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "namespaces",
              + "nodes",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.kubernetes_cluster_role_binding.team["bitbuy"] will be created
  + resource "kubernetes_cluster_role_binding" "team" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "bitbuy-team-cluster-role-binding"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "bitbuy-team-cluster-role"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "bitbuy-group"
          + namespace = "default"
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.kubernetes_namespace.team["bitbuy"] will be created
  + resource "kubernetes_namespace" "team" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "name" = "bitbuy"
            }
          + name             = "bitbuy"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.kubernetes_resource_quota.team_compute_quota["bitbuy"] will be created
  + resource "kubernetes_resource_quota" "team_compute_quota" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "compute-quota"
          + namespace        = "bitbuy"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + hard = {
              + "limits.cpu"      = "4000m"
              + "limits.memory"   = "16Gi"
              + "requests.cpu"    = "2000m"
              + "requests.memory" = "8Gi"
            }
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.kubernetes_resource_quota.team_object_quota["bitbuy"] will be created
  + resource "kubernetes_resource_quota" "team_object_quota" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "object-quota"
          + namespace        = "bitbuy"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + hard = {
              + "pods"     = "20"
              + "secrets"  = "20"
              + "services" = "20"
            }
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.kubernetes_role.team["bitbuy"] will be created
  + resource "kubernetes_role" "team" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "bitbuy-role"
          + namespace        = "bitbuy"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "*",
            ]
          + resources  = [
              + "configmaps",
              + "deployments",
              + "horizontalpodautoscalers",
              + "networkpolicies",
              + "pods",
              + "podtemplates",
              + "replicasets",
              + "secrets",
              + "serviceaccounts",
              + "services",
              + "statefulsets",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "*",
            ]
          + resources  = [
              + "resourcequotas",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.kubernetes_role_binding.team["bitbuy"] will be created
  + resource "kubernetes_role_binding" "team" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "bitbuy-role-binding"
          + namespace        = "bitbuy"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "bitbuy-role"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "bitbuy-group"
          + namespace = "bitbuy"
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.aws_eks_teams.kubernetes_service_account.team["bitbuy"] will be created
  + resource "kubernetes_service_account" "team" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "bitbuy-sa"
          + namespace        = "bitbuy"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.aws-eks-accelerator-for-terraform.module.kms[0].aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/aws001-preprod-teod-eks"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.aws-eks-accelerator-for-terraform.module.kms[0].aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "aws001-preprod-teod-eks EKS cluster secret encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + kms:CallerAccount = "656980674876"
                              + kms:ViaService    = "eks.ca-central-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::656980674876:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow access for all principals in the account that are authorized"
                    },
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:List*",
                          + "kms:Get*",
                          + "kms:Describe*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::656980674876:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow direct access to key metadata to the account"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::656980674876:role/tf-deploy-role",
                              + "arn:aws:iam::656980674876:role/aws001-preprod-teod-eks-cluster-role",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Allow access for Key Administrators"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::656980674876:role/aws001-preprod-teod-eks-cluster-role"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow use of the key"
                    },
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:ListGrants",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + Bool = {
                              + kms:GrantIsForAWSResource = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::656980674876:role/aws001-preprod-teod-eks-cluster-role"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow attachment of persistent resources"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
      + tags_all                           = {
          + "created-by"  = "Terraform v1.0.1"
          + "environment" = "preprod"
          + "name"        = "aws001-preprod-teod-eks"
          + "resource"    = "eks"
          + "tenant"      = "aws001"
          + "zone"        = "teod"
        }
    }

  # module.kubernetes-addons.module.argocd[0].data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.kubernetes-addons.module.argocd[0].data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.kubernetes-addons.module.argocd[0].helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + description                = "The argocd HelmChart Ingress Controller deployment configuration"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argo-cd"
      + namespace                  = "argocd"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1200
      + values                     = [
          + <<-EOT
                redis-ha:
                  enabled: true
                
                controller:
                  enableStatefulSet: true
                
                server:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                
                repoServer:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
            EOT,
        ]
      + verify                     = false
      + version                    = "3.26.8"
      + wait                       = true
      + wait_for_jobs              = false

      + postrender {}
    }

  # module.kubernetes-addons.module.argocd[0].helm_release.argocd_application["addons"] will be created
  + resource "helm_release" "argocd_application" {
      + atomic                     = false
      + chart                      = "../../../modules/kubernetes-addons/argocd/argocd-application"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "addons"
      + namespace                  = "argocd"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "destination.server"
          + value = "https://kubernetes.default.svc"
        }
      + set {
          + name  = "name"
          + value = "addons"
        }
      + set {
          + name  = "project"
          + value = "default"
        }
      + set {
          + name  = "source.helm.releaseName"
          + value = "addons"
        }
      + set {
          + name  = "source.helm.values"
          + value = (known after apply)
        }
      + set {
          + name  = "source.path"
          + value = "chart"
        }
      + set {
          + name  = "source.repoUrl"
          + value = "https://github.com/bitbuy-infrastructure/argocd-infra-deployment.git"
        }
      + set {
          + name  = "source.targetRevision"
          + value = "HEAD"
        }
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "PutLogEvents"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "CreateCWLogs"
        }
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].data.aws_iam_policy_document.kms will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "kms"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Enable IAM User Permissions"

          + principals {
              + identifiers = [
                  + (known after apply),
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt*",
              + "kms:Describe*",
              + "kms:Encrypt*",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Enable Encryption for LogGroup"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "kms:EncryptionContext:aws:logs:arn"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Service"
            }
        }
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].data.aws_iam_session_context.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_session_context" "current"  {
      + arn          = (known after apply)
      + id           = (known after apply)
      + issuer_arn   = (known after apply)
      + issuer_id    = (known after apply)
      + issuer_name  = (known after apply)
      + session_name = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].aws_cloudwatch_log_group.aws_for_fluent_bit will be created
  + resource "aws_cloudwatch_log_group" "aws_for_fluent_bit" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].aws_iam_policy.aws_for_fluent_bit will be created
  + resource "aws_iam_policy" "aws_for_fluent_bit" {
      + arn         = (known after apply)
      + description = "IAM Policy for AWS for FluentBit"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.kubernetes-addons.module.karpenter[0].data.aws_eks_cluster.eks will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "eks"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.kubernetes-addons.module.karpenter[0].data.aws_iam_policy_document.karpenter will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "karpenter"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:CreateFleet",
              + "ec2:CreateLaunchTemplate",
              + "ec2:CreateTags",
              + "ec2:DescribeAvailabilityZones",
              + "ec2:DescribeInstanceTypeOfferings",
              + "ec2:DescribeInstanceTypes",
              + "ec2:DescribeInstances",
              + "ec2:DescribeLaunchTemplates",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSubnets",
              + "ec2:RunInstances",
              + "iam:PassRole",
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Karpenter"
        }
      + statement {
          + actions   = [
              + "ec2:TerminateInstances",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "ConditionalEC2Termination"

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*karpenter*",
                ]
              + variable = "ec2:ResourceTag/Name"
            }
        }
    }

  # module.kubernetes-addons.module.karpenter[0].data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.kubernetes-addons.module.karpenter[0].aws_iam_policy.karpenter will be created
  + resource "aws_iam_policy" "karpenter" {
      + arn         = (known after apply)
      + description = "IAM Policy for Karpenter"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.irsa.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.irsa.data.aws_eks_cluster.eks_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "eks_cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.irsa.data.aws_iam_policy_document.irsa_with_oidc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:logging:aws-for-fluent-bit-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.irsa.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.irsa.aws_iam_role.irsa will be created
  + resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.irsa.aws_iam_role_policy_attachment.irsa[0] will be created
  + resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.irsa.kubernetes_namespace_v1.irsa[0] will be created
  + resource "kubernetes_namespace_v1" "irsa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "terraform-ssp-amazon-eks"
            }
          + name             = "logging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.irsa.kubernetes_service_account_v1.irsa[0] will be created
  + resource "kubernetes_service_account_v1" "irsa" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "terraform-ssp-amazon-eks"
            }
          + name             = "aws-for-fluent-bit-sa"
          + namespace        = "logging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.kms[0].aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.kubernetes-addons.module.aws_for_fluent_bit[0].module.kms[0].aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "EKS Workers FluentBit CloudWatch Log group KMS Key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.kubernetes-addons.module.karpenter[0].module.irsa_addon.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.kubernetes-addons.module.karpenter[0].module.irsa_addon.data.aws_eks_cluster.eks_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "eks_cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.kubernetes-addons.module.karpenter[0].module.irsa_addon.data.aws_iam_policy_document.irsa_with_oidc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:karpenter:karpenter-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.kubernetes-addons.module.karpenter[0].module.irsa_addon.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.kubernetes-addons.module.karpenter[0].module.irsa_addon.aws_iam_role.irsa will be created
  + resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.kubernetes-addons.module.karpenter[0].module.irsa_addon.aws_iam_role_policy_attachment.irsa[0] will be created
  + resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.kubernetes-addons.module.karpenter[0].module.irsa_addon.kubernetes_namespace_v1.irsa[0] will be created
  + resource "kubernetes_namespace_v1" "irsa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "terraform-ssp-amazon-eks"
            }
          + name             = "karpenter"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes-addons.module.karpenter[0].module.irsa_addon.kubernetes_service_account_v1.irsa[0] will be created
  + resource "kubernetes_service_account_v1" "irsa" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "terraform-ssp-amazon-eks"
            }
          + name             = "karpenter-sa"
          + namespace        = "karpenter"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 83 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @onzyone, Action: `pull_request`*